; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image0 - mode
	infrared3 - mode
	thermograph1 - mode
	infrared2 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star8 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(have_image Planet11 infrared3)
	(have_image Planet12 infrared2)
	(have_image Planet13 infrared3)
	(have_image Planet14 thermograph1)
	(have_image Planet15 thermograph1)
	(have_image Phenomenon16 thermograph1)
	(have_image Planet17 infrared2)
	(have_image Phenomenon18 thermograph1)
))

)

; plan
1. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet12)
   goals met: 0 of 8
5. (take_image satellite0 planet12 instrument0 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 1 of 8
6. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 1 of 8
7. (take_image satellite0 planet11 instrument0 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon18 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon18)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon18 instrument0 thermograph1)
   added: (have_image phenomenon18 thermograph1)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon16 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon16)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon16 instrument0 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 4 of 8
12. (turn_to satellite0 planet13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet13)
   goals met: 4 of 8
13. (take_image satellite0 planet13 instrument0 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 5 of 8
14. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 5 of 8
15. (take_image satellite0 planet14 instrument0 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 6 of 8
16. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 6 of 8
17. (take_image satellite0 planet15 instrument0 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 7 of 8
18. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 7 of 8
19. (take_image satellite0 planet17 instrument0 infrared2)
   added: (have_image planet17 infrared2)
   goals met: 8 of 8
